SimonBachmaier/gag-box-stm32/Inc/bmi160_reg.h
/*
 * BMI160_Reg.h
 *
 *  Created on: 25.12.2019
 *      Author: daniel
 */

#ifndef BMI160_REG_H_
#define BMI160_REG_H_

#define BMI160_REG_CHIP_ID		((uint8_t)0x00)
#define BMI160_REG_ERR_REG		((uint8_t)0x02)
#define BMI160_REG_PMU_STATUS		((uint8_t)0x03)
#define BMI160_REG_DATA_0		((uint8_t)0x04)
#define BMI160_REG_DATA_1		((uint8_t)0x05)
#define BMI160_REG_DATA_2		((uint8_t)0x06)
#define BMI160_REG_DATA_3		((uint8_t)0x07)
#define BMI160_REG_DATA_4		((uint8_t)0x08)
#define BMI160_REG_DATA_5		((uint8_t)0x09)
#define BMI160_REG_DATA_6		((uint8_t)0x0a)
#define BMI160_REG_DATA_7		((uint8_t)0x0b)
#define BMI160_REG_DATA_8		((uint8_t)0x0c)
#define BMI160_REG_DATA_9		((uint8_t)0x0d)
#define BMI160_REG_DATA_10		((uint8_t)0x0e)
#define BMI160_REG_DATA_11		((uint8_t)0x0f)
#define BMI160_REG_DATA_12		((uint8_t)0x10)
#define BMI160_REG_DATA_13		((uint8_t)0x11)
#define BMI160_REG_DATA_14		((uint8_t)0x12)
#define BMI160_REG_DATA_15		((uint8_t)0x13)
#define BMI160_REG_DATA_16		((uint8_t)0x14)
#define BMI160_REG_DATA_17		((uint8_t)0x15)
#define BMI160_REG_DATA_18		((uint8_t)0x16)
#define BMI160_REG_DATA_19		((uint8_t)0x17)
#define BMI160_REG_SENSORTIME_0		((uint8_t)0x18)
#define BMI160_REG_SENSORTIME_1		((uint8_t)0x19)
#define BMI160_REG_SENSORTIME_2		((uint8_t)0x1a)
#define BMI160_REG_STATUS		((uint8_t)0x1b)
#define BMI160_REG_INT_STATUS_0		((uint8_t)0x1c)
#define BMI160_REG_INT_STATUS_1		((uint8_t)0x1d)
#define BMI160_REG_INT_STATUS_2		((uint8_t)0x1e)
#define BMI160_REG_INT_STATUS_3		((uint8_t)0x1f)
#define BMI160_REG_TEMPERATURE_0	((uint8_t)0x20)
#define BMI160_REG_TEMPERATURE_1	((uint8_t)0x21)
#define BMI160_REG_FIFO_LENGTH_0	((uint8_t)0x22)
#define BMI160_REG_FIFO_LENGTH_1	((uint8_t)0x23)
#define BMI160_REG_FIFO_DATA		((uint8_t)0x24)
#define BMI160_REG_ACC_CONF		((uint8_t)0x40)
#define BMI160_REG_ACC_RANGE		((uint8_t)0x41)
#define BMI160_REG_GYR_CONF		((uint8_t)0x42)
#define BMI160_REG_GYR_RANGE		((uint8_t)0x43)
#define BMI160_REG_MAG_CONF		((uint8_t)0x44)
#define BMI160_REG_FIFO_DOWNS		((uint8_t)0x45)
#define BMI160_REG_FIFO_CONFIG_0	((uint8_t)0x46)
#define BMI160_REG_FIFO_CONFIG_1	((uint8_t)0x47)
#define BMI160_REG_MAG_IF_0		((uint8_t)0x4b)
#define BMI160_REG_MAG_IF_1		((uint8_t)0x4c)
#define BMI160_REG_MAG_IF_2		((uint8_t)0x4d)
#define BMI160_REG_MAG_IF_3		((uint8_t)0x4e)
#define BMI160_REG_MAG_IF_4		((uint8_t)0x4f)
#define BMI160_REG_INT_EN_0		((uint8_t)0x50)
#define BMI160_REG_INT_EN_1		((uint8_t)0x51)
#define BMI160_REG_INT_EN_2		((uint8_t)0x52)
#define BMI160_REG_INT_OUT_CTRL		((uint8_t)0x53)
#define BMI160_REG_INT_LATCH		((uint8_t)0x54)
#define BMI160_REG_INT_MAP_0		((uint8_t)0x55)
#define BMI160_REG_INT_MAP_1		((uint8_t)0x56)
#define BMI160_REG_INT_MAP_2		((uint8_t)0x57)
#define BMI160_REG_INT_DATA_0		((uint8_t)0x58)
#define BMI160_REG_INT_DATA_1		((uint8_t)0x59)
#define BMI160_REG_INT_LOWHIGH_0	((uint8_t)0x5a)
#define BMI160_REG_INT_LOWHIGH_1	((uint8_t)0x5b)
#define BMI160_REG_INT_LOWHIGH_2	((uint8_t)0x5c)
#define BMI160_REG_INT_LOWHIGH_3	((uint8_t)0x5d)
#define BMI160_REG_INT_LOWHIGH_4	((uint8_t)0x5e)
#define BMI160_REG_INT_MOTION_0		((uint8_t)0x5f)
#define BMI160_REG_INT_MOTION_1		((uint8_t)0x60)
#define BMI160_REG_INT_MOTION_2		((uint8_t)0x61)
#define BMI160_REG_INT_MOTION_3		((uint8_t)0x62)
#define BMI160_REG_INT_TAP_0		((uint8_t)0x63)
#define BMI160_REG_INT_TAP_1		((uint8_t)0x64)
#define BMI160_REG_INT_ORIENT_0		((uint8_t)0x65)
#define BMI160_REG_INT_ORIENT_1		((uint8_t)0x66)
#define BMI160_REG_INT_FLAT_0		((uint8_t)0x67)
#define BMI160_REG_INT_FLAT_1		((uint8_t)0x68)
#define BMI160_REG_FOC_CONF		((uint8_t)0x69)
#define BMI160_REG_CONF			((uint8_t)0x6a)
#define BMI160_REG_IF_CONF		((uint8_t)0x6b)
#define BMI160_REG_PMU_TRIGGER		((uint8_t)0x6c)
#define BMI160_REG_SELF_TEST		((uint8_t)0x6d)
#define BMI160_REG_NV_CONF		((uint8_t)0x70)
#define BMI160_REG_OFFSET_0		((uint8_t)0x71)
#define BMI160_REG_OFFSET_1		((uint8_t)0x72)
#define BMI160_REG_OFFSET_2		((uint8_t)0x73)
#define BMI160_REG_OFFSET_3		((uint8_t)0x74)
#define BMI160_REG_OFFSET_4		((uint8_t)0x75)
#define BMI160_REG_OFFSET_5		((uint8_t)0x76)
#define BMI160_REG_OFFSET_6		((uint8_t)0x77)
#define BMI160_REG_STEP_CNT_0		((uint8_t)0x78)
#define BMI160_REG_STEP_CNT_1		((uint8_t)0x79)
#define BMI160_REG_STEP_CONF_0		((uint8_t)0x7a)
#define BMI160_REG_STEP_CONF_1		((uint8_t)0x7b)
#define BMI160_REG_CMD			((uint8_t)0x7e)

#endif /* BMI160_REG_H_ */
